#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_STG/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/f692dc45-2411-41f7-ac95-da948714f1a7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/96650edd-ac15-4f9c-a27b-2be7231344bf]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/9ce4e013-c2b7-4379-a46e-1c6b495803a6]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/7430c88e-e4e4-4bbd-b262-d4c9bc3ba564]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/895c4a65-e67d-4657-bba3-df5a1440fc58]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-PRIMARY-SOURCE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/PRIMARY_SOURCE"]: Refreshing state... [id=moh_applications/client/3f1fc7bd-2f6b-43e8-8564-0e2276fc9f41/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/4b919d71-c76b-4621-be50-f05a7e8ed144]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.METASPACE.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + base_url                                  = "https://metadev.hlth.gov.bc.ca/"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "METASPACE"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Healthideas Metaspace is the metadata repository for the Ministry of Health's enterprise data warehouse (Healthideas)."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "METASPACE"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://logontest7.gov.bc.ca/clp-cgi/logoff.cgi*",
          + "https://metadev.hlth.gov.bc.ca/*",
          + "https://metaspace.ddev.site/*",
          + "https://qa-sts.healthbc.org/adfs/ls/*",
        ]
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.METASPACE.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.METASPACE.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "address",
          + "microprofile-jwt",
          + "offline_access",
          + "phone",
        ]
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.METASPACE.keycloak_openid_user_attribute_protocol_mapper.idir_company will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "idir_company" {
      + add_to_access_token  = true
      + add_to_id_token      = true
      + add_to_userinfo      = false
      + aggregate_attributes = false
      + claim_name           = "idir_company"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "idir_company"
      + realm_id             = "moh_applications"
      + user_attribute       = "idir_company"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @ahoplock, Action: `pull_request`*